[
  "quick-latex",
  "shortcuts-extender",
  "super-duper-audio-recorder",
  "editing-toolbar",
  "obsidian-excalidraw-plugin",
  "obsidian-enhancing-export",
  "obsidian-pandoc",
  "better-export-pdf",
  "omnisearch",
  "obsidian-image-caption",
  "obsidian-git"
]