import numpy as np
V0=63/(10**3)
n=1450
Qn1=85
pn1=16*10**6
pvs1=0.5*10**6
#Теоретическая подача:
Q_teor=V0*n
print("теоретическая подача:", Q_teor)
eff_V=Qn1/Q_teor
print("Объемный КПД:", eff_V)
#Потери:
q_op1=-Qn1+Q_teor
print("Объемные потери:",q_op1)
#Мощности:
N_n1=(pn1-pvs1)*Qn1/60/1000
print("Мощность насоса:",N_n1)
N_op1=(pn1-pvs1)*q_op1/60/1000
print("Мощность объемных потерь:", N_op1)

#Задача 2:
print("\n\nЗадача 2")
n2=2000
pn2=10*10**6
#Теоретическая подача
Q_teor2=V0*n2
print("Теоретическая подача:",Q_teor2)
#Теоретические потери:
q_op2=q_op1*(pn2-pvs1)/(pn1-pvs1)
print("Теоретические потери:", q_op2)
#Действительная подача:
Qd2=Q_teor2-q_op2
print("Фактическая подача:",Qd2)
#Мощность насоса:
N_n2=(pn2-pvs1)*Qd2/60000
print("Выходная мощность:", N_n2)
#Мощность потерь
N_op2=(pn2-pvs1)*q_op2/60000
print("Мощность потерь:", N_op2)
eff2=Qd2/Q_teor2
print(eff2)
